package Additions;

public class Additions {
    public static void main(String[] args) {

        //Примеры сложений
        int a = 10;

        //Способы сложнеия - 1ый
        a = a + 1;

        //Способы сложнеия - 2ой
        a += 1;

        //Способы сложнеия - 3ий - оператор инкримента
        a++;

        //Способы вычитания - 1ый
        a = a - 1;

        //Способы вычитания - 2ой
        a -= 1;

        //Способы вычитания - 3ий - оператор дикримента
        a--;

        //Циклы
        //Начальное значение
        int i = 1;
        //Будем повторять пока i меньше 1000
        while (i <= 1000) {
            System.out.println(i);
            //Увеличиваем на 1
            i++;

            //Если хотим прервать цикл, когда дойдет до 5
            if (i == 5) {
                break;
            }
        }
    }
}
