package Square;

public class Triangle {
    public static void main(String[] args) {

        //Чтобы узнать значение гипотенузы, используем теорему Пифагора.
        //Сумма квадратов длин катетов равна квадрату длины гипотенузы
        //Длина катетов равна a и b, длина гипотенузы = с; Формула содержит = с(гипотенуза) = a*a(катет1) + b*b(катет2)

        //Длина катетов
        double a = 3;
        double b = 4;

        //Применяем формулу Пифагора, используя Math.sqrt
        double c = Math.sqrt(a * a + b * b);

        //Выводим гипотенузу
        System.out.println(c);
    }
}
