package СategoriesTipe;

public class Example {
    public static void main(String[] args) {

        //Категории примитивных (простых типов)
        byte b;             //Целое число = 1 байт от -128 до 177
        short sh;           //Целое число = 2 байта от -32768 до 32767
        int in;             //Целое число = 4 байта от -2147483648 до 2147483647
        long lg;            //Целое число = 8 байт от 9223372936854775808 до 9223372036854775807

        float fl;           //Дробные числа = 4 байта - небольшая точность
        double db;          //Дробные числа = 8 бейт - двойная точность

        char ch;            //Символы char 'Y' или номер 89; Существует таблица сиомволов ASCII

        boolean bl = true;  //Логическое значение true или false (истина или ложь)
    }
}
